dambreaktest/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }

    atm
    {
        type            totalPressure;
        p0              uniform 100000;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        //value           uniform 0;
    }

/*
    atm
    {
	type		outletInlet;
	outletValue 	uniform 0;
	value 		uniform 100000;
    }
*/
/*
    atm
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
*/
    floor
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
